app/controllers/cms/admin/pages_controller.rb

SELECT `pages`.id FROM `pages` WHERE (slug = 'home' and parent_id IS NULL) LIMIT 1
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 1)
---
  def index
    @pages = Page.ordered

SELECT * FROM `pages` ORDER BY position
---
  def new
    @page = Page.new
    @pages = Page.ordered

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
SELECT * FROM `pages` ORDER BY position
---
  def edit
    @page = Page.find(params[:id])
    @pages = Page.ordered

SELECT `pages`.id FROM `pages` WHERE (slug = 'steve' and parent_id IS NULL) LIMIT 1
INSERT INTO `pages` (`slug`, `visible`, `updated_at`, `title`, `template_name`, `subtitle`, `in_navigation`, `path`, `position`, `parent_id`, `created_at`) VALUES('test', 1, '2009-10-06 19:44:24', 'Test', 'content', 'Test1', NULL, 'test', NULL, 1, '2009-10-06 19:44:24')
---
  def create
    @page = Page.new(params[:page])
    @pages = Page.ordered

    if @page.save

SELECT * FROM `pages` WHERE (`pages`.`id` = 6)
SELECT * FROM `pages`
UPDATE `pages` SET `path` = 'home/refder', `parent_id` = 1, `updated_at` = '2009-10-07 16:26:23' WHERE `id` = 6
---
  def update
    @page = Page.find(params[:id])
    @pages = Page.ordered

    if @page.update_attributes(params[:page])

SELECT * FROM `pages` WHERE (`pages`.`id` = 3)
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 3)
DELETE FROM `pages` WHERE `id` = 3
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy