app/controllers/cms/content_controller.rb

  def show
    @page, @is_404 = Page.find_from_path(params[:path])
---
SELECT `pages`.id FROM `pages` WHERE (slug = 'new-slug' and id != 954 and parent_id IS NULL) LIMIT 1
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 223)